package by.htp.task07.text;

/*Создать объект класса Текст, используя классы Предложение, Слово. Методы: дополнить текст, вывести на консоль текст, заголовок текста.
*/
public class Main {
	
	public static void main (String [] args) {
	
	Word word1 = new Word ("Mother");
	Word word2 = new Word ("father");
	Word word3 = new Word ("and");
	
	Sentence sentence1 = new Sentence();
	PartOfSentence part;
	
	sentence1.addWord(word1);
	sentence1.addWord(word3);
	sentence1.addWord(word2);
	sentence1.dot;
	
	
	System.out.println (sentence);

	
	
	
	}
}
